Catalogs/ШаблоныВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ШаблоныВыплатПоДоговорамОпеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплачиваетсяПриВозрастеДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаВыплатПоДоговорамОпеки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрожиточныйМинимум</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрожиточныеМинимумы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсключаяДатуОт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключаяДатуДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыРасчетаВыплатПоДоговорамОпеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаВыплатПоДоговорамОпеки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КоэффициентНаМРОТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентНаПрожиточныйМинимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйРазмер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ШаблоныВыплатПоДоговорамОпеки/Forms/ВводДанныхДляРасчетаРазмераВыплаты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособРасчетаФиксированныйРазмер             = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.ФиксированныйРазмер;
	СпособРасчетаКоэффициентНаПрожиточныйМинимум = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаПрожиточныйМинимум;
	СпособРасчетаКоэффициентНаМРОТ               = Перечисления.СпособыРасчетаВыплатПоДоговорамОпеки.КоэффициентНаМРОТ;
	
	Параметры.Свойство("СпособРасчета", СпособРасчета);
	Параметры.Свойство("ПрожиточныйМинимум", ПрожиточныйМинимум);
	Параметры.Свойство("Размер", Размер);
	Параметры.Свойство("Коэффициент", Коэффициент);
	ВозвращаемоеЗначениеУстановлено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ВозвращаемоеЗначениеУстановлено Тогда 
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("СпособРасчета", СпособРасчета);
		РезультатВыбора.Вставить("ПрожиточныйМинимум", ПрожиточныйМинимум);
		РезультатВыбора.Вставить("Размер", Размер);
		РезультатВыбора.Вставить("Коэффициент", Коэффициент);
		ОповеститьОВыборе(РезультатВыбора);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	ВозвращаемоеЗначениеУстановлено = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ВозвращаемоеЗначениеУстановлено = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Если СпособРасчета = СпособРасчетаФиксированныйРазмер Тогда
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Истина;
		Элементы.Коэффициент.Видимость = Ложь;
	ИначеЕсли СпособРасчета = СпособРасчетаКоэффициентНаПрожиточныйМинимум Тогда 
		Элементы.ПрожиточныйМинимум.Видимость = Истина;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Истина;
	ИначеЕсли СпособРасчета = СпособРасчетаКоэффициентНаМРОТ Тогда 
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Истина;
	Иначе
		Элементы.ПрожиточныйМинимум.Видимость = Ложь;
		Элементы.Размер.Видимость = Ложь;
		Элементы.Коэффициент.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
